def tweak_strip(words):
    ret = set()
    for word in words:
        ret.add(word.strip())
    return ret


def tweak_remove_word(items):
    def not_in(word):
        for i in items:
            if word.find(i) != -1:
                return False
        return True

    def cb(words):
        ret = set()
        for word in words:
            if not_in(word):
                ret.add(word)
        return ret

    return cb


def tweak_split_word(spliters):

    def cb(words):
        for i in spliters:
            tmp = set()
            for word in words:
                for j in word.split(i):
                    tmp.add(j)
            words = tmp
        return words

    return cb


def tweak_remove_chars(chars):

    def cb(words):
        for char in chars:
            tmp = set()
            for word in words:
                updated_word = word.replace(char, "")
                tmp.add(updated_word)
            words = tmp
        return words

    return cb


def tweak_match_cjk(words):
    def is_cjk(char):
        return "\u4e00" <= char <= "\u9fff"

    tmp = set()
    for word in words:
        new_word = ""
        for char in word:
            if is_cjk(char):
                new_word += char
            else:
                tmp.add(new_word)
                new_word = ""
        if new_word:
            tmp.add(new_word)
    return tmp


def tweak_remove_regex(regexes):
    import re

    compiled_patterns = [re.compile(pattern) for pattern in regexes]

    def cb(words):
        ret = words
        for pattern in compiled_patterns:
            ret = {item for item in ret if not pattern.match(item)}
        return ret

    return cb


def tweak_len_gt(min_length):

    def cb(words):
        filtered_words = set()
        for word in words:
            if len(word) > min_length:
                filtered_words.add(word)
        return filtered_words

    return cb


tweaks = [
    tweak_strip,
    tweak_remove_word([]),  # 删除包含指定词的词条
    tweak_split_word(["&", "-", "(", ")", "：", "（", "）"]),
    tweak_remove_chars(" ·αβ“”•「」！，"),
    tweak_match_cjk,
    tweak_remove_regex([]),  # 删除指定正则匹配的词条
    tweak_len_gt(1),
]

if __name__ == "__main__":
    filtered_titles = {'感染者纠察官', '源石虫·β', '陨星', '帝国前锋百战精锐', 'TG-7', 'IC-MO-1', 'TW-4', '富营养的喷溅者', '佩佩', '“愤怒蹬踏”', '无胄盟清扫小队组长', '脉冲防御模组', '泰拉大陆调查团', '“剧团喉舌”', '灌木丛', 'S-1 谴罚的尽头', '改进型量产巨像', 'WD-7', '9-2', 'RI-EX-5', 'NL-S-3', '“投石机”', '富营养的收割者', '“睚”', '最初的落脚点（沙中之火）', 'TG-1', '无阻冲锋官', 'IW-1', 'CB-EX2', '机动盾组长', 'MB-3', '青枳', '“胆小如鼷”驮兽补给员', '狂暴宿主组长', '战争本能（沙中之火）', '杏仁', '枯朽之种', 'GT-HX-3', '苍苔', '弧光突击队', '“盛怒”', 'FC-2', '富营养的引痕者', 'ISW-NO 乐理之灾', 'VEC-SP04', '变异岩蛛α', 'ISW-NO 首演', 'TW-5', '夜灯', '“鼠王”', '渡桥', 'DM-MO-1', '玷', '马特奥的亲卫', '14-12', '水手长重艇', '雪怪小队凿冰人', 'CR-EX-8', '战术猎犬', '黑夜锦标秀', 'IG-EX-1', '蚀清', '末路狂徒', 'TR-6', '萨卡兹哨兵', '6-12', 'ISW-NO 呼吸', '号角', '俗心', '月禾', '石英', '古米', '和弦', 'CW-EX-7', 'SV-EX-4', '火神', '冰爆源石虫', 'DT-EX-6', '灼热源石虫', '外骨骼', 'BP-8', 'DV-3', '坚岩冠兽', '恶尘源石虫·α', '喷气人', '13-12', 'GA-EX-8', 'IG-S-4', 'H6-1', 'SL-EX-4', '萨卡兹枯朽战士组长', 'SN-S-4-A', '森西', 'CR-1', 'IG-1', '多萝西', '殿堂左侧雕像', '10-5', 'IS-QT 沃尔西尼市政中心', 'MN-TR-1', 'CB-10', 'ISW-NO 教徒居所', '采集主任站', 'AS-5', 'RI-3', '生计（沙中之火）', '11-2', 'FA-2', '奥达', '马特奥的近卫', '巫术巨像', '“织郁伯爵”', 'ISW-SP 真相', 'BP-EX-2', 'HE-EX-6', 'OD-EX-2', '高级军用猎狗', '盐风溶洞', '血珀', '箱形恐鱼（装置）', 'IC-EX-7', '“都可以砸”', 'ISW-SP “喜”从箱来', '0-4', 'GO-4', '凯尔希（敌）', '攀云机', '鸭爵', 'VI-4', '斗士塔露拉', 'BW-8', 'GA-EX-1', 'CH-3', 'SK-5', 'ISW-DF 大盗当头', '3-3', 'ISW-NO 火力小队', '狂化矿脉守卫', 'S5-1', '古老废城高塔', '残党首席小提琴家', '1-8', 'AS-S-1', '“小躁”', '防水蚀镀膜装置', '危险术师囚犯', 'ISW-NO 幽影与鬼魅', '震撼装置', 'ISW-NO 坍缩体的午后', 'WR-1', '加固装置', '无垠回荡克雷松', '再铸扈从', '匪帮射手', '始海穿刺者', '迷珍巧械', 'BF-3', '狂暴宿主掷骨手', '艾拉', 'ZT-4', '缪尔赛思', '“交通警长”', '10-11', 'ISW-NO 弄假成真', 'H13-4', 'FD-6', '海沫', '“夹子”', 'RS-4', '罗小黑', '狂暴的猎狗pro', '“祟”', 'TR-5', '树林之主（沙中之火）', '庇护制造器', 'GT-EX-1', '天桩（装置）', 'HS-EX-6', 'ISW-DF 巍峨银凇', 'SL-S-3', 'ISW-NO 何处无山海', 'SN-S-2-B', 'CW-TR-1', '丰饶灌木林（沙洲遗闻）', '9-3', '0-3', '9-18', '翠影关（沙洲遗闻）', 'S5-6', '别塔卜-阿帕卡里（沙洲遗闻）', '战场观测炮手', 'ISW-NO 猩红甬道', 'IS-6', '诗画卷轴', 'OF-EX5', 'WB-9', '障碍物（愚人节）', '重弩猎杀者', 'IG-2', '速冷喷雾发射台', '“最后的蒸汽骑士”', 'R-31a重型动力装甲', '寻路者阵地破坏者', 'TW-2', '风情街“星术师”', '玫兰莎', 'WD-EX-2', '无人爆破重艇', 'OF-2', 'CF-EX-3', '迷迭香的战术装备', '游击队盾卫组长', 'ISW-DF 大群所向', '控潮术师', 'ISW-NO 咫尺天涯', '特制水上平台', '振奋荣光', 'HE-4', 'VEC-SP01', '异光体洋流使者', '萨卡兹枯朽辟路前锋', '乌萨斯平民', '海霓', '5-6', 'FA-7', '歪曲施法者', '接潮蔑死体', 'S5-5', 'BI-6', 'ISW-NO 通道封锁', 'HE-2', '羽毛笔', '机动卫兵', '元核孽生者', '家族士兵', '源石爆炸物', '时光守卫', '醒神秘药', '采集专员站', 'DC-7', '休止符街道', '深溟巢涌者', '“源石虫之心”', '游击队突袭战士', 'ISW-DF 险路勿近', '磨砻', '骨海漂流体', 'BI-8', '哈兰杜汗，大地之鞭', '星熊', '感知链接器', 'A-1 奉身觐火', '翠梦遗址（沙洲遗闻）', '砾', '“变形者集群”', '折光', '匪帮窃贼头目', 'ISW-DF 诸事不顺', 'ISW-NO 无罪净土', 'ISW-NO 互助', '折叠设施维护员', '暴鸰·G', 'ISW-NO 劳作的清晨', '拟南盏', '遗弃地块', '火哨', '樱桃三号', '宿主重装士兵', 'ISW-NO 隔岸观火', 'SA-3', '速射劲弩手', '反巫术变位炸弹', 'RS-EX-3', '改性植物激素', 'ISW-SP 鸭速公路', '10-15', 'HS-EX-2', '无垠回荡球', 'H11-4', '10-3', '骑士领蛰伏者', 'SV-EX-1', 'S4-1', 'ISW-NO 漩涡', '威龙', '取舍（沙洲遗闻）', '大型兽栏', 'ISW-DF 开门请当心', '焰影苇草', 'AS-4', '废旧地块残骸', 'GO-EX-2', 'ISW-NO 奉献', '编制术师组长', 'CH-7', '乌萨斯裂兽族母', 'CF-EX-7', '指挥官厄尔苏拉', '温泉“流浪汉”', '特里蒙城防军队长', 'TR-S-1', 'THRM-EX', '尊主的残影', '11-13', 'Dor-3号改造体', '10-10', 'S5-2', '14-2', 'ISW-NO 利刃所指', '嘉维尔', '恶尘源石虫', 'S4-3', '作战专用掩体', '冰原猎人队长', '荒漠', '“超甜微笑”', '安德切尔', 'SK-2', '战术装备整理箱', 'CV-7', '赏金猎人弩手', '浮海飘航者', 'IG-5', '畸变恶性瘤', 'RS-EX-1', '澄闪', 'CB-EX3', 'ISW-SP 自然条款', '溢能回收转化器', '引火的死魂灵', 'CA-2', 'WR-10', '溟痕', 'TW-EX-6', '陷落雪祀', '水边矿脉（沙中之火）', '复核洋流使者', '“木裂”埃克提尔尼尔', '萨卡兹子裔责罚者', 'IC-8', 'RI-7', '行脚艺徒', '联邦监狱', '感染者高级纠察官', '高效泡打粉', '至简', 'ISW-NO 领地意识', '石棉', '深池护卫队精锐成员', '“力大如驮”鼷兽补给员', '“街头闲汉”', '岁相', '征税的选择（沙洲遗闻）', 'SL-8', 'DT-6', 'ISW-DF 迈入永恒', 'FD-5', '高阶术师组长', '深池重甲卫士', '山海众掌令使', 'ISW-NO 水火相容', 'ISW-NO 步步紧逼', '4-3', '灰尾', '射手', 'CR-8', '石材采集站·采购', '“无根之怨”', '0-11', '暴行', 'ISW-NO 离歌的庭院', '奎隆，摩诃萨埵权化', '伊祖米克的子代', '圣徒之手', 'CB-7', 'S-2 王朝的灰烬', '铁矛头', '持盾精锐骑士', '洪流束激发器', '雪怪小队破冰者', 'GT-5', '荒地鼷兽', 'VEC-08', '异光体孽生者', 'DV-2', '粗圆岩', 'IS-EX-2', 'LE-EX-6', '炮击组长', '联络员', 'SL-S-5', '原始奔腾（沙洲遗闻）', '谜图', '实验基地机库', 'ISW-NO 炉工志愿队', 'GA-6', '源石流发生装置', '哈洛德', '狂徒', 'TB-1', '逻各斯', '菲亚梅塔', '“被弃者”', '千仞关（沙洲遗闻）', '提亚卡乌神投手', '摩根', '冰原术师', '模块演算设施', 'IG-TR-1', '可靠电池', 'GO-EX-7', 'TB-DB-4', '不法分子', '14-14', '空构', 'ZT-10', 'GT-1', 'H12-1', '沸血骑士团学徒', 'IW-3', '异光体集养者', '浮士德', '明椒', '家族弩手', '“红标”精英根除者', '10-14', '萨卡兹王庭军战士', 'AS-3', 'WB-EX-4', '魂灵涡流', '沙堡建筑者', 'IG-S-3', '菈玛莲', '播种无人机', '13-11', '爆裂毒气罐', '赏金猎人扰乱者', '防御工事', 'GA-1', 'ISW-NO 育生池', 'ISW-NO 先来后到', '莱茵生命工程科成员', '10-12', '游击队盾卫', 'ISW-DF 时光之沙', '伊桑', '战争幽灵', '阵地守门员', 'KR-5', '萨卡兹悖谬暴虐兵长', '萨卡兹枯朽术师', '鄙瘴', '恐卡兹', '“交通亭”量产型', 'FC-EX-6', '7-12', '见证所（沙洲遗闻）', 'AS-EX-8', '0-2', '传奇战争幽灵', '巫王乐团小号手', 'ISW-SP 物权纠纷', '红隼', '莱茵生命防卫科成员', '1-6', 'GA-7', 'SV-EX-7', 'CW-EX-8', 'TN-3 裂地重击', 'VI-3', '11-15', '9-5', '13-17', '田鼷猛士', 'DT-EX-5', 'ISW-SP 天途半道', '自走车出发点', 'FD-1', 'SL-EX-1', '重装防御者-S型', 'CW-1', '237-2号展柜文物', '狂暴凶豕兽', 'ISW-NO 公害', 'ISW-NO 余烬方阵', '7-5', '武装密探长', '封印的地面（生路）', '缤纷果酒', 'IS-S-5', 'VI-6', '霍尔海雅', 'T-4 虫巢喷发', '狙击步兵', '殉亡魂灵圣杯', 'ISW-NO 狩猎场', '折叠式维护车', '安赛尔', '濯尘芙蓉', '14-5', '寻宝人', '隐形术师组长', '量产巨像', '反装甲步兵组长', '“寒灾”', 'ISW-SP 玩具的报复', '小丘郡物流站', '伐木征税（沙中之火）', '注亡拟嗣', '焦急的“小躁”', '富营养的狂奔者', 'RI-2', '爱国者', 'R-11a突击动力装甲（装置）', '机械水獭', 'KR-S-2', 'DT-3', '波卜', '提亚卡乌破坏王', '薇薇安娜', 'IG-EX-5', 'T-1 焰雨荒林', 'TB-2', '结晶岩壳蟹', '破烂拼凑者', 'BB-EX-3', '阿米娅（近卫）', '鞭刃', '佣兵的所属（沙洲遗闻）', 'SN-EX-1', 'BH-7', 'S3-4', 'ISW-NO 分赃不均', 'HS-8', '10-9', 'IW-EX-4', '共振装置', '创生之相', '3-5', '沥血王座', '囊海爬行者', 'WR-EX-2', 'MN-EX-1', '涤火杰西卡', '军械库东', 'SN-S-1-A', 'WB-4', '双月', '罗宾', '双持剑士', '10-17', '简易弩台', 'HS-S-4', 'IC-EX-8', '“十字路口”量产型', 'TR-14', '路加萨尔古斯，历法之王', 'ISW-SP 邪异囚笼', '黄金盟誓', 'H14-3', '7-20', 'TW-EX-7', 'OF-ST5', '唤血祭坛', '匪帮混混', 'BH-1', '萨卡兹刀兵', '风情街“飞空员”', 'ISW-NO 霜与沙', '4-1', '6-1', '流星', 'ISW-NO 混乱的表象', '旷野流贼', '冰爆源石虫·α', '“交通亭”试做型', '深池逐火精锐战士', 'TW-EX-4', 'L-44"留声机"', 'ZT-5', '遗智还家（沙中之火）', 'ZT-EX-4', 'ISW-DF 圣城', '阿戈尔示波器', '5-5', '游击队萨卡兹战士组长', '青铜镜', '景观巨蕈', 'Mon2tr', '家族精英术师', '空弦', 'BB-EX-6', '1-7', '游击队猎犬pro', '试验场（沙洲遗闻）', '寻觅道路（沙洲遗闻）', '“匕现”', 'TW-EX-1', '“贪婪捕手”', 'NL-EX-2', '“一往无前”铁头前锋', 'H9-3', '玛利图斯，“海嗣”', '重锤补给员', '布卢塔巴图（沙洲遗闻）', '暗潮钳兽·α', '都市风壁障', '参差林木（沙洲遗闻）', 'CW-S-2-A', 'MN-4', '飞檐客-叶无轻', '流浪工匠“修补工”', 'CR-2', '真理', 'TG-8', 'IC-7', '浊心斯卡蒂', '临时掩护装置', 'GA-EX-3', '令', '闪灵', '乌萨斯裂兽', 'DV-TR-1', '苏苏洛', '青瓷茶器', '淤浊沼泽', '无人危楼', '固海凿石者', '遗迹残骸', '叛乱煽动者', 'GA-4', '冰封雪谷', 'IC-EX-6', '雷蛇', '御4', '渴血的子裔', 'CE-6', 'CW-S-3-A', '“慰朽灵幛”', 'BP-TR-1', 'H9-5', 'ISW-NO 王冠之下', '温泉“淘气包”', '12面骰子', '残党小提琴家', '11-7', '卡达', '酒类爱好者', '辐能源石虫·α', '智能空域控制机', '红木瑞印', '码头水手', 'DC-2', 'CB-EX1', '酸液源石虫', '弧光镜卫长', 'IS-EX-3', '深池重甲卫士队长', '塞雷娅', '冬灵猎犬', '实体程式控制', 'LE-EX-1', '采集实习站', '铁矿采集站·采购', '“巨大的丑东西”', '“护目镜”帮派打手', '“愿板与你同在”', '方形竞技场（沙洲遗闻）', '纸偶', '岛中蟹穴（沙洲遗闻）', 'RI-4', '“横冲直撞”重锤补给员', '王酋巫术师', '迷迭香', '寻仇者', 'ISW-DF 哨兵', '泥岩（敌）', '反侦察藏匿机', '“雪牝”', '萨卡兹王庭军精锐术师', 'ISW-DF 无中生钱', '“锈铜”奥尔默·英格拉', '锏（敌）', 'IM-2', 'IS-EX-7', 'TN-1 冰霜与战火', '白面鸮', '赞助无人机', '伦蒂尼姆城防副炮', 'CB-1', '11-14', 'RS-EX-4', 'LE-EX-2', '愤怒的守墓石像', 'BP-EX-5', '去蚀', '普通囚犯', '除秽', '山海众头目', 'BW-7', 'HS-EX-7', 'TB-5', '自由佣兵“主音吉他”', 'OF-EX3', '5-2', '尖刺宝箱(sm)', '驮兽旅行家', '士兵', '深池暗影术师', '破旧的木篱', '夜魔', 'WD-EX-3', '深池逐火护卫', 'R8-1', '寻路者精锐战士', '6-16', 'DM-EX-5', '粉碎攻坚组长', '强壮囚犯', '迷雾战区', 'CR-TR-1', '14-6', 'CE-2', '塌落的墙垣', '“街头卖艺者”', 'ISW-NO 杂音干扰', 'ISW-NO 求敌得敌', 'BP-EX-7', '提亚卡乌战士', 'KR-3', 'CR-EX-1', '高阶术师', '高能瓦斯车', '散华骑士团精锐', '清流', '无胄盟弩手', '残党阵地术师', '凋零骑士', '传奇重犯', '赛场补给车', '温米', '罗德岛临时雇员', '蚀', '法术调和能量场', 'ISW-NO 飞越大水坑', '翻修中沙滩', '木制镇纸', '11-16', '华法琳', '查尔斯·林奇', 'TG-4', 'MB-EX-5', 'ISW-NO 惊喜工厂', '黑水源石虫', 'S9-3', 'BH-5', '守卫自然（沙中之火）', 'VEC-02', '幻影', '炽热溶洞', 'ZT-S-4', '荒芜广场', '赘生甲壳', '野鬃', 'ZT-3', '古老藤蔓', '12-4', 'WD-5', 'AW-2', '萨卡兹大剑组长', 'GT-HX-1', '休整区发讯器', '13-18', '隐形弩手', '普罗旺斯', '萨卡兹穿刺手组长', 'IC-1', 'HS-EX-5', 'S7-2', '拟南兽', 'UO-3', '7-9', '“头头是门”阵地守门员', '乌萨斯高级突袭弩手', '高能源石炸弹', 'ZT-EX-8', '湖畔志愿者', 'ISW-NO 有序清场', '铁砧B型', 'WB-8', '潜伏者', 'S4-10', 'LK-DP-D', '神经再生', '技术侦察兵', '极光', 'CB-EX4', 'DT-EX-4', 'ISW-NO 落魄骑士', 'CB-4', 'SL-TR-1', 'ISW-NO 安全检查', '空间稳定设施', '林中寻宝（沙中之火）', '丢失的订单（沙中之火）', '纯烬艾雅法拉', '“暴食之果”', '老练囚犯', '饱腹的子裔', 'CF-8', '槐琥', '银灰', '直奔深渊（沙洲遗闻）', '5-8', '加苏尔拟真赛（沙洲遗闻）', 'ZT-EX-6', '战士的视野（沙中之火）', '大地病征（沙洲遗闻）', 'ISW-DF 人之光辉', 'VI-5', '格劳克斯', '枯朽祭坛', 'FD-3', 'TC-2', '墨浪', 'CR-5', '九色鹿', 'S7-1', 'ISW-DU 高普尼克之拳', 'BI-EX-1', '寻路者知名甜品商', '1-2', '薄绿', '“街头音乐家”', 'BP-EX-3', '阿勒黛的卫护', 'BB-2', '潜水员', '萨卡兹枯朽不屈宿卫', '变异岩蛛', '欺凌者', '残党乐团长笛手', '家族术师', '航道信标', '“三头犬”', '萨卡兹征用尖端无人机', '14-8', '剧场组装体', '畸变赘生物', '钳兽壳粉', '特米米', 'ISW-NO 浮空城接舷战', 'S4-7', 'FC-6', '从不混淆的方向', '老练拾荒者', '可移动战术机库', 'ISW-NO 驯兽小屋', '追猎发射台', 'GT-2', '老练猎手', 'ISW-NO 守望的河水', '新硎', '红', '破碎支柱', '4-4', 'H5-2', 'AS-EX-3', '237-1号展柜文物', '13-15', 'FC-EX-8', '10-2', '基地', '圈养（沙中之火）', '无名独立骑士', '狂暴宿主投掷手', '“报幕助手”', '乌萨斯突击者', 'TW-S-2', '荷谟伊勇士', '折叠式后勤站', 'MB-EX-7', '0-1', 'ISW-NO 无声呼号', '萨尔贡契约刺客', 'ISW-NO 溟痕乐园', '重装五十夫长', 'RMA70刺球', '高准度伦蒂尼姆城防自行炮', '3-2', '急救包', '9-16', 'SN-S-2-A', '家族铁腕角头', '14-11', 'BH-4', '14-22', '“红标”根除者', 'CB-5', 'TW-MO-1', 'DV-4', '9-17', 'ISW-NO 异体同心', '重型沼泽探照车', '蜜酿级醒酒助手', '11-20', '弧光突击队队长', '12-7', 'S4-2', '遭遇战（沙洲遗闻）', 'GT-HX-2', '炽焰源石虫', 'ISW-NO 崇敬深海', '萨卡兹狙击组长', '耶拉', 'BB-TR-1', '崎岖窄路（沙中之火）', '12-3', '阿消', '7-14', '富营养的巢涌者', '深池狙击手', '箱形恐鱼', '炎客', '塑路者', '流眼泪侦探', '铃兰', 'MN-8', '虫影密植（沙洲遗闻）', 'H14-2', '被限制的怒火（沙洲遗闻）', 'OD-EX-6', 'S3-1', 'S4-9', '13-7', '凶豕兽', '凯尔希', 'GT-EX-3', 'TR-24', '“邪魔的利刃”，游荡者', '工蚁', 'ISW-NO 生人勿近', '新街', '荒原窃盗者精英', '山雪鬼', '“物欲拮抗者”', 'FA-4', '59区废墟', '工具训练（沙洲遗闻）', '14-9', '家族精英弩手', 'BI-EX-3', 'ISW-NO 赴敌者', '圣像', '山海众窥魅人', '护盾遥控器', 'IC-EX-5', '游砂兽', 'ISW-NO 以守代攻', '“与我无关”', 'CH-1', 'DT-EX-1', '访问团强攻冠军', '慕斯', '冰瀑喷射罐', 'VEC-07', '伐木机', 'S4-4', '14-4', '赤冬', 'IW-9', 'KR-2', 'OD-EX-7', '弩手', 'WB-EX-5', '3-1', 'Castle-3', '微核沉积者', 'H14-4', 'LS-4', 'BB-S-4', '提亚卡乌撕裂者', '无形界限（沙中之火）', 'ISW-NO 建制', 'H12-2', '崖心', '岩壳蟹群（沙洲遗闻）', '军工厂指令平台', '弧光锋卫', '晶珑兽', '灵巧之兽（沙中之火）', 'SN-EX-5', 'ISW-NO 存亡之战', '镜中虚影', '诺伯特平民', '行脚艺人', '崎岖乱石岗（沙洲遗闻）', '暴走食人花', '雪绒', '芙蓉'}

    for func in tweaks:
        filtered_titles = func(filtered_titles)

    print(filtered_titles)
